AshanMadusanka/stm32f746xx-drivers/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <string.h>

#include "stm32f746xx.h"


/** SPI2 Pins  ALT5
 * PB9 --->NSS
 * PB10--->SCK
 * PB14--->MISO
 * PB15___>MOSI
 */
void SPI_GpioInit();
void SPI2_Inits();

void Delay() {
    for (uint32_t i = 0; i < 5000000; i++) {
        // Simple delay loop
    }
}

int main(void) {


    char user_data[] = "Hello world";

    SPI_GpioInit();
    SPI2_Inits();

    SPI_SSOEConfig(SPI2,ENABLE);

    SPI_PeripheralControl(SPI2, ENABLE);

    uint8_t data_length = strlen(user_data);
    SPI_SendData(SPI2,&data_length,1);
    SPI_SendData(SPI2,(uint8_t*)user_data,strlen(user_data));


   // SPI_PeripheralControl(SPI2, DISABLE);

    while(1);

}


void SPI_GpioInit() {

    GPIO_Handle_t SPIPins;

    SPIPins.pGPIOx = GPIOB; // Use GPIOB for SPI2
    SPIPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALT; // Set to alternate function mode
    SPIPins.GPIO_PinConfig.GPIO_PinAltFunMode = 5; // Alternate function for SPI2
    SPIPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP; // Push-pull output type
    SPIPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD; // No pull-up or pull-down
    SPIPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST; // Fast speed

    // Configure SPI2 pins
    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_9; // NSS
    GPIO_Init(&SPIPins);

    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_10; // SCK
    GPIO_Init(&SPIPins);

    // SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_14; // MISO
    // GPIO_Init(&SPIPins);

    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_15; // MOSI
    GPIO_Init(&SPIPins);
}

void SPI2_Inits() {
    SPI_Handle_t SPI2Handle;

    SPI2Handle.pSPIx = SPI2;
    SPI2Handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
    SPI2Handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
    SPI2Handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV8;
    SPI2Handle.SPIConfig.SPI_DFF = SPI_DFF_8BITS;
    SPI2Handle.SPIConfig.SPI_CPOL =SPI_CPOL_LOW;
    SPI2Handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
    SPI2Handle.SPIConfig.SPI_SSM = SPI_SSM_DI; // Disable software slave management

    SPI_Init(&SPI2Handle);


}
